In [2]:
import pandas as pd
import numpy as np

In [3]:
d={'Car_Id':[101,102,103,104,105,106],
   'Car_name':['BMW','AUDI','BENZ','BENTLY','FERRARI',None]
  }

In [4]:
data=pd.DataFrame(d)

In [5]:
data

   Car_Id Car_name
0     101      BMW
1     102     AUDI
2     103     BENZ
3     104   BENTLY
4     105  FERRARI
5     106     None

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Car_Id    6 non-null      int64
 1   Car_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 224.0+ bytes

In [7]:
data.columns

Index(['Car_Id', 'Car_name'], dtype='object')

In [8]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
data['Car_Id']

0    101
1    102
2    103
3    104
4    105
5    106
Name: Car_Id, dtype: int64

In [10]:
data['Car_name']

0        BMW
1       AUDI
2       BENZ
3     BENTLY
4    FERRARI
5       None
Name: Car_name, dtype: object

In [11]:
data.isnull()

   Car_Id  Car_name
0   False     False
1   False     False
2   False     False
3   False     False
4   False     False
5   False      True

In [12]:
data.iloc[2]

Car_Id       103
Car_name    BENZ
Name: 2, dtype: object

In [13]:
data.loc[1
        ]

Car_Id       102
Car_name    AUDI
Name: 1, dtype: object

In [14]:
data.iloc[5]

Car_Id       106
Car_name    None
Name: 5, dtype: object

In [15]:
data.set_index('Car_Id')

       Car_name
Car_Id
101         BMW
102        AUDI
103        BENZ
104      BENTLY
105     FERRARI
106        None

In [16]:
data.loc[1]

Car_Id       102
Car_name    AUDI
Name: 1, dtype: object

In [17]:
data.dropna()

   Car_Id Car_name
0     101      BMW
1     102     AUDI
2     103     BENZ
3     104   BENTLY
4     105  FERRARI

In [18]:
d={'Car_Id':[101,102,103,104,105,106],
   'Car_name':['BMW','AUDI','BENZ','BENTLY','FERRARI',None]
  }

In [19]:
data=pd.DataFrame(d)

In [20]:
data

   Car_Id Car_name
0     101      BMW
1     102     AUDI
2     103     BENZ
3     104   BENTLY
4     105  FERRARI
5     106     None

In [21]:
data.fillna('JEEP')

   Car_Id Car_name
0     101      BMW
1     102     AUDI
2     103     BENZ
3     104   BENTLY
4     105  FERRARI
5     106     JEEP